/*
 * SPDX-License-Identifier: GPL-3.0-or-later
 * Copyright (C) 2026 RanShaoEFCH
 *
 * EDiskFreeze - A lightweight reboot-to-restore disk protection driver.
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program. If not, see <https://www.gnu.org/licenses/>.
 */

#include <ntifs.h>
#include <ntddk.h>
#include <wdm.h>
#include <ntstrsafe.h>
#include <wchar.h>
#include <ntimage.h>
#include <windef.h>
#include <minwindef.h>
#include <stdlib.h>
#include <fltKernel.h>
#include <intrin.h>
#include "h/IrpFile.h"
#include "h/DataVerify.h"
#include "h/common.h"
#include "h/diskhook.h"

#if defined(_DEBUG) || defined(DBG)
#define DbgPrint(...) (DbgPrint)(__VA_ARGS__)
#else
#define DbgPrint(...) ((void)0)
#endif

PDRIVER_OBJECT driver;
PDEVICE_OBJECT deviceObject = NULL;
#define IOCTL_KILLPROCESS CTL_CODE(FILE_DEVICE_UNKNOWN, 0x800, METHOD_BUFFERED, FILE_ANY_ACCESS) //ZwTerminateProcess

NTSTATUS NTAPI ObReferenceObjectByName(IN PUNICODE_STRING ObjectName, IN ULONG64 Attributes, IN PACCESS_STATE PassedAccessState OPTIONAL, IN ACCESS_MASK DesiredAccess OPTIONAL, IN POBJECT_TYPE ObjectType, IN KPROCESSOR_MODE AccessMode, IN OUT PVOID ParseContext OPTIONAL, OUT PVOID* Object);
NTSTATUS PsSuspendProcess(PEPROCESS Process);
NTSTATUS PsResumeProcess(PEPROCESS Process);

/*/NTSTATUS SeCreateAccessState(
	PACCESS_STATE AccessState,
	PVOID AuxData,
	ACCESS_MASK DesiredAccess,
	PGENERIC_MAPPING GenericMapping
);
NTSTATUS ObCreateObject(
	__in KPROCESSOR_MODE ProbeMode,
	__in POBJECT_TYPE ObjectType,
	__in POBJECT_ATTRIBUTES ObjectAttributes,
	__in KPROCESSOR_MODE OwnershipMode,
	__inout_opt PVOID ParseContext,
	__in ULONG ObjectBodySize,
	__in ULONG PagedPoolCharge,
	__in ULONG NonPagedPoolCharge,
	__out PVOID* Object
);
*/
NTSYSAPI
PIMAGE_NT_HEADERS
NTAPI
RtlImageNtHeader(
	IN PVOID                ModuleAddress);
VOID IoUnregisterPriorityCallback(_In_ PDRIVER_OBJECT DriverObject);
VOID PoUnregisterCoalescingCallback(
	_In_  PVOID Handle);

NTSTATUS PsSetCreateProcessNotifyRoutineEx2(
	PSCREATEPROCESSNOTIFYTYPE NotifyType,
	PVOID                     NotifyInformation,
	BOOLEAN                   Remove
);

PVOID NTAPI RtlFindExportedRoutineByName(_In_ PVOID ImageBase, _In_ PCCH RoutineName);
NTKERNELAPI VOID NTAPI HalReturnToFirmware(
	LONG lReturnType
);

VOID
_sgdt(
	_Out_ PVOID Descriptor
);
NTKERNELAPI PPEB NTAPI PsGetProcessPeb(IN PEPROCESS Process);
NTKERNELAPI PVOID NTAPI PsGetThreadTeb(PETHREAD pEthread);
NTKERNELAPI NTSTATUS
PsReferenceProcessFilePointer(
	IN PEPROCESS Process,
	OUT PVOID* pFilePointer
);
NTSYSAPI
UCHAR*
PsGetProcessImageFileName(
	PEPROCESS Process
);
EXTERN_C_END
/*
typedef NTSTATUS(__fastcall* _PspTerminateProcess)(
	PVOID Process,       // EPROCESS (rcx)
	PVOID Thread,        // 当前线程 (rdx)
	NTSTATUS ExitStatus, // 退出状态码 (r8)
	ULONG Flags          // 控制标志 (r9)
	);// For Windows 10 22H2 19045.6216
_PspTerminateProcess pspTerminateProcess = NULL;
*/

typedef unsigned int(__fastcall* _PspTerminateProcess)(
	__int64 Process,     // EPROCESS (RCX)
	__int64 Thread,      // ETHREAD (RDX) 
	unsigned int ExitCode, // 退出状态码 (R8)
	int Flags           // 控制标志 (R9)
	);
_PspTerminateProcess pspTerminateProcess = NULL;

typedef NTSTATUS(__stdcall* _NtTerminateProcess)(
	HANDLE ProcessHandle,
	NTSTATUS ExitStatus
	);
static PVOID ntterminateprocess = NULL;

typedef NTSTATUS(__stdcall* _PsSuspendProcess)(
	PEPROCESS Process
	);

static PVOID pssuspendprocess = NULL;
static PVOID ntdeviceiocontrolfile = NULL;

typedef void(__stdcall* _KeBugCheckEx)(
	_In_ ULONG BugCheckCode,
	_In_ ULONG_PTR BugCheckParameter1,
	_In_ ULONG_PTR BugCheckParameter2,
	_In_ ULONG_PTR BugCheckParameter3,
	_In_ ULONG_PTR BugCheckParameter4
	);

typedef NTSTATUS(NTAPI* _NtDeviceIoControlFile)(
	HANDLE FileHandle,
	HANDLE Event,
	PIO_APC_ROUTINE ApcRoutine,
	PVOID ApcContext,
	PIO_STATUS_BLOCK IoStatusBlock,
	ULONG IoControlCode,
	PVOID InputBuffer,
	ULONG InputBufferLength,
	PVOID OutputBuffer,
	ULONG OutputBufferLength
	);

static PVOID kebugcheckex = NULL;

typedef struct _LDR_DATA
{
	struct _LIST_ENTRY InLoadOrderLinks;
	struct _LIST_ENTRY InMemoryOrderLinks;
	struct _LIST_ENTRY InInitializationOrderLinks;
	VOID* DllBase;
	VOID* EntryPoint;
	ULONG32      SizeOfImage;
	UINT8        _PADDING0_[0x4];
	struct _UNICODE_STRING FullDllName;
	struct _UNICODE_STRING BaseDllName;
	ULONG32      Flags;
}LDR_DATA, * PLDR_DATA;

typedef struct _DATA_INFO {
	WCHAR wcstr[1024];
	ULONG ulongdata4;
} DATA_INFO, * PDATA_INFO;

typedef struct _DRIVERS_INFO {
	WCHAR wcstr[1024];
	ULONG BaseAddress;

} DRIVERS_INFO, * PDRIVERS_INFO;

enum FIRMWARE_REENTRY
{
	HalHaltRoutine,
	HalPowerDownRoutine,
	HalRestartRoutine,
	HalRebootRoutine,
	HalInteractiveModeRoutine,
	HalMaximumRoutine
} FIRMWARE_REENTRY, * PFIRMWARE_REENTRY;

typedef struct _PROCESS_BREAK_ON_TERMINATION {
	ULONG BreakOnTermination;
} PROCESS_BREAK_ON_TERMINATION, * PPROCESS_BREAK_ON_TERMINATION;

typedef struct _APC_CONTEXT {
	PEPROCESS TargetProcess;
	PETHREAD TargetThread;
} APC_CONTEXT, * PAPC_CONTEXT;

typedef struct _LDR_DATA_TABLE_ENTRY
{
	struct _LIST_ENTRY InLoadOrderLinks;                                    //0x0
	struct _LIST_ENTRY InMemoryOrderLinks;                                  //0x10
	struct _LIST_ENTRY InInitializationOrderLinks;                          //0x20
	VOID* DllBase;                                                          //0x30
	VOID* EntryPoint;                                                       //0x38
	ULONG SizeOfImage;                                                      //0x40
	struct _UNICODE_STRING FullDllName;                                     //0x48
	struct _UNICODE_STRING BaseDllName;                                     //0x58
	union
	{
		UCHAR FlagGroup[4];                                                 //0x68
		ULONG Flags;                                                        //0x68
		struct
		{
			ULONG PackagedBinary : 1;                                         //0x68
			ULONG MarkedForRemoval : 1;                                       //0x68
			ULONG ImageDll : 1;                                               //0x68
			ULONG LoadNotificationsSent : 1;                                  //0x68
			ULONG TelemetryEntryProcessed : 1;                                //0x68
			ULONG ProcessStaticImport : 1;                                    //0x68
			ULONG InLegacyLists : 1;                                          //0x68
			ULONG InIndexes : 1;                                              //0x68
			ULONG ShimDll : 1;                                                //0x68
			ULONG InExceptionTable : 1;                                       //0x68
			ULONG ReservedFlags1 : 2;                                         //0x68
			ULONG LoadInProgress : 1;                                         //0x68
			ULONG LoadConfigProcessed : 1;                                    //0x68
			ULONG EntryProcessed : 1;                                         //0x68
			ULONG ProtectDelayLoad : 1;                                       //0x68
			ULONG ReservedFlags3 : 2;                                         //0x68
			ULONG DontCallForThreads : 1;                                     //0x68
			ULONG ProcessAttachCalled : 1;                                    //0x68
			ULONG ProcessAttachFailed : 1;                                    //0x68
			ULONG CorDeferredValidate : 1;                                    //0x68
			ULONG CorImage : 1;                                               //0x68
			ULONG DontRelocate : 1;                                           //0x68
			ULONG CorILOnly : 1;                                              //0x68
			ULONG ChpeImage : 1;                                              //0x68
			ULONG ReservedFlags5 : 2;                                         //0x68
			ULONG Redirected : 1;                                             //0x68
			ULONG ReservedFlags6 : 2;                                         //0x68
			ULONG CompatDatabaseProcessed : 1;                                //0x68
		};
	};
	USHORT ObsoleteLoadCount;                                               //0x6c
	USHORT TlsIndex;                                                        //0x6e
	struct _LIST_ENTRY HashLinks;                                           //0x70
	ULONG TimeDateStamp;                                                    //0x80
	struct _ACTIVATION_CONTEXT* EntryPointActivationContext;                //0x88
	VOID* Lock;                                                             //0x90
	struct _LDR_DDAG_NODE* DdagNode;                                        //0x98
	struct _LIST_ENTRY NodeModuleLink;                                      //0xa0
	struct _LDRP_LOAD_CONTEXT* LoadContext;                                 //0xb0
	VOID* ParentDllBase;                                                    //0xb8
	VOID* SwitchBackContext;                                                //0xc0
	struct _RTL_BALANCED_NODE BaseAddressIndexNode;                         //0xc8
	struct _RTL_BALANCED_NODE MappingInfoIndexNode;                         //0xe0
	ULONGLONG OriginalBase;                                                 //0xf8
	union _LARGE_INTEGER LoadTime;                                          //0x100
	ULONG BaseNameHashValue;                                                //0x108
	enum _LDR_DLL_LOAD_REASON LoadReason;                                   //0x10c
	ULONG ImplicitPathOptions;                                              //0x110
	ULONG ReferenceCount;                                                   //0x114
	ULONG DependentLoadFlags;                                               //0x118
	UCHAR SigningLevel;                                                     //0x11c
}LDR_DATA_TABLE_ENTRY, * PLDR_DATA_TABLE_ENTRY;

typedef struct _OBJECT_DIRECTORY_INFORMATION {
	UNICODE_STRING Name;
	UNICODE_STRING TypeName;
} OBJECT_DIRECTORY_INFORMATION, * POBJECT_DIRECTORY_INFORMATION;

typedef NTSTATUS(NTAPI* ZWQUERYDIRECTORYOBJECT)(
	_In_ HANDLE DirectoryHandle,
	_Out_opt_ PVOID Buffer,
	_In_ ULONG Length,
	_In_ BOOLEAN ReturnSingleEntry,
	_In_ BOOLEAN RestartScan,
	_Inout_ PULONG Context,
	_Out_opt_ PULONG ReturnLength
	);

typedef struct _UNLOAD_THREAD_CONTEXT {
	PDRIVER_OBJECT DriverObject;
	BOOLEAN HasUnloadRoutine;
	KEVENT CompletionEvent;
	NTSTATUS Result;
} UNLOAD_THREAD_CONTEXT, * PUNLOAD_THREAD_CONTEXT;

typedef struct _Lite_Driver_Info {
	WCHAR BaseDllName[512];
} Lite_Driver_Info, * PLite_Driver_Info;

typedef struct _Lite_Driver_Info2 {
	WCHAR BaseDllName[512];
} Lite_Driver_Info2, * PLite_Driver_Info2;

